#+TITLE: 14: Create Conformance Endpoints Json

** Output view as json
   #+begin_src sql-mode
     begin;
     \t
     \a
     \o ../../resources/coverage/conformance-endpoints.json
       select json_agg(ce) as output_json
       from (
         select * from conformance.endpoint
         ) ce;
     \o
     \a
     \t
     commit;

   #+end_src

   #+RESULTS:
   #+begin_SRC example
   BEGIN
   Tuples only is on.
   Output format is unaligned.
   #+end_SRC
We can check this with jq
#+begin_src shell
 cat ../../resources/coverage/conformance-endpoints.json | jq '.[0]'
#+end_src

#+RESULTS:
#+begin_example
{
  "endpoint": "listEventsV1EventForAllNamespaces",
  "promotion_release": "1.19.0",
  "tested_release": "1.19.0",
  "tests": [
    {
      "file": "test/e2e/instrumentation/events.go",
      "release": "1.19.0",
      "codename": "[sig-instrumentation] Events API should ensure that an event can be fetched, patched, deleted, and listed [Conformance]",
      "testname": "New Event resource lifecycle, testing a single event"
    }
  ]
}
#+end_example

just beautiful, a nice object with an array of unique tests that hit it.

